window.HARDWARE_QUIZ_DATA = [
  {
    "paper": "ハードウェア",
    "questions": [
      {
        "no": "問01",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "演算機能は制御機能からの指示で演算処理を行う。"
          },
          {
            "key": "イ",
            "text": "演算機能は制御機能，入力機能及び出力機能とデータの受渡しを行う。"
          },
          {
            "key": "ウ",
            "text": "記憶機能は演算機能に対して演算を依頼して結果を保持する。"
          },
          {
            "key": "エ",
            "text": "記憶機能は出力機能に対して記憶機能のデータを出力するように依頼を出す。"
          }
        ],
        "text": "コンピュータを構成する一部の機能の説明として，適切なものはどれか。"
      },
      {
        "no": "問02",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "プロセッサ"
          },
          {
            "key": "イ",
            "text": "キーボード"
          },
          {
            "key": "ウ",
            "text": "プリンター"
          },
          {
            "key": "エ",
            "text": "メモリ"
          }
        ],
        "text": "記憶装置はどれか？"
      },
      {
        "no": "問03",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "1001"
          },
          {
            "key": "イ",
            "text": "0010"
          },
          {
            "key": "ウ",
            "text": "0111"
          },
          {
            "key": "エ",
            "text": "0101"
          }
        ],
        "text": "10 進数である 7 を 2 進数であらわしたものは、次のうちどれか"
      },
      {
        "no": "問04",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "00003321"
          },
          {
            "key": "イ",
            "text": "00011010"
          },
          {
            "key": "ウ",
            "text": "00001233"
          },
          {
            "key": "エ",
            "text": "01101111"
          }
        ],
        "text": "10 進数の 111 を 8 桁の 4 進数として表したものはどれか。"
      },
      {
        "no": "問05",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "8"
          },
          {
            "key": "イ",
            "text": "9"
          },
          {
            "key": "ウ",
            "text": "10"
          },
          {
            "key": "エ",
            "text": "7"
          }
        ],
        "text": "2 進数である「1010」を 10 進数であらわしたものは、次のうちどれか"
      },
      {
        "no": "問06",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "0.1011"
          },
          {
            "key": "イ",
            "text": "0.1001"
          },
          {
            "key": "ウ",
            "text": "0.1101"
          },
          {
            "key": "エ",
            "text": "0.1111"
          }
        ],
        "text": "10 進数の 0.68751 を 2 進数で表したものはどれか。"
      },
      {
        "no": "問07",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "制御装置や演算装置が内蔵されたチップである。"
          },
          {
            "key": "イ",
            "text": "命令やデータを保存している場所を指定するための番号である。"
          },
          {
            "key": "ウ",
            "text": "プロセッサ、主記憶装置、補助記憶装置の間でデータを流すための回線である。"
          },
          {
            "key": "エ",
            "text": "主記憶から取り出した命令やデータを一時的に保存しておくところ。"
          }
        ],
        "text": "コンピュータ内部のバスについて正しい説明はどれか？"
      },
      {
        "no": "問08",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "アドレス方式"
          },
          {
            "key": "イ",
            "text": "仮想記憶方式"
          },
          {
            "key": "ウ",
            "text": "直接プログラム制御方式"
          },
          {
            "key": "エ",
            "text": "プログラム記憶方式"
          }
        ],
        "text": "プログラムを主記憶に読み込んでおき，CPU が順次読み出し実行する方式はどれか。"
      },
      {
        "no": "問09",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "多くのパソコンで用いられており，モデムや周辺装置との間でデータを直列に転送するための規格である。"
          },
          {
            "key": "イ",
            "text": "入出力装置と主記憶との間のデータ転送を CPU と独立に行う機構である。"
          },
          {
            "key": "ウ",
            "text": "バックプレーンや拡張スロットで使用されており，複数の装置が共有するディジタル信号伝送路である。"
          },
          {
            "key": "エ",
            "text": "ハブによるツリー構造の接続ができ，データ転送には高速，低速の二つのモードがある。"
          }
        ],
        "text": "システムバスの説明として，適切なものはどれか。"
      },
      {
        "no": "問10",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "オペランド読出し → 命令の解読 → 命令フェッチ → 命令の実行"
          },
          {
            "key": "イ",
            "text": "オペランド読出し → 命令フェッチ → 命令の解読 → 命令の実行"
          },
          {
            "key": "ウ",
            "text": "命令の解読 → 命令フェッチ → オペランド読出し → 命令の実行"
          },
          {
            "key": "エ",
            "text": "命令フェッチ → 命令の解読 → オペランド読出し → 命令の実行"
          }
        ],
        "text": "コンピュータの命令実行順序として，適切なものはどれか。"
      },
      {
        "no": "問11",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "演算を行うために，メモリから読み出したデータを保持する。"
          },
          {
            "key": "イ",
            "text": "条件付き分岐命令を実行するために，演算結果の状態を保持する。"
          },
          {
            "key": "ウ",
            "text": "命令のデコードを行うために，メモリから読み出した命令を保持する。"
          },
          {
            "key": "エ",
            "text": "命令を読み出すために，次の命令が格納されたアドレスを保持する。"
          }
        ],
        "text": "CPU のプログラムレジスタ（プログラムカウンタ）の役割はどれか。"
      },
      {
        "no": "問12",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "a：演算装置，b：記憶装置，c：制御装置"
          },
          {
            "key": "イ",
            "text": "a：記憶装置，b：制御装置，c：演算装置"
          },
          {
            "key": "ウ",
            "text": "a：制御装置，b：演算装置，c：記憶装置"
          },
          {
            "key": "エ",
            "text": "a：制御装置，b：記憶装置，c：演算装置"
          }
        ],
        "text": "コンピュータの基本構成を表す図中の a～c に入れるべき適切な字句の組合せはどれか",
        "figure": "<p class=\"figureTitle\">コンピュータの基本構成</p>\n  <div class=\"basicComputerOriginal\">\n    <svg class=\"basicComputerSvg\" viewBox=\"0 0 520 260\" role=\"img\" aria-label=\"コンピュータの基本構成\">\n      <defs>\n        <marker id=\"basicArrow\" viewBox=\"0 0 10 10\" refX=\"8\" refY=\"5\" markerWidth=\"6\" markerHeight=\"6\" orient=\"auto-start-reverse\">\n          <path d=\"M 0 0 L 10 5 L 0 10 z\"></path>\n        </marker>\n      </defs>\n      <rect class=\"unit\" x=\"118\" y=\"22\" width=\"110\" height=\"38\"></rect>\n      <text x=\"173\" y=\"47\" text-anchor=\"middle\">a</text>\n      <rect class=\"unit\" x=\"18\" y=\"112\" width=\"86\" height=\"34\"></rect>\n      <text x=\"61\" y=\"135\" text-anchor=\"middle\">入力装置</text>\n      <rect class=\"unit\" x=\"118\" y=\"112\" width=\"110\" height=\"38\"></rect>\n      <text x=\"173\" y=\"137\" text-anchor=\"middle\">b</text>\n      <rect class=\"unit\" x=\"118\" y=\"198\" width=\"110\" height=\"38\"></rect>\n      <text x=\"173\" y=\"223\" text-anchor=\"middle\">c</text>\n      <rect class=\"unit\" x=\"318\" y=\"112\" width=\"86\" height=\"34\"></rect>\n      <text x=\"361\" y=\"135\" text-anchor=\"middle\">出力装置</text>\n      <path class=\"data\" d=\"M104 129 H118\"></path>\n      <path class=\"data\" d=\"M173 112 V62\"></path>\n      <path class=\"data\" d=\"M173 150 V196\"></path>\n      <path class=\"data\" d=\"M228 129 H318\"></path>\n      <path class=\"control\" d=\"M173 62 V91 H61 V111\"></path>\n      <path class=\"control\" d=\"M228 41 H426 V129 H405\"></path>\n      <path class=\"control\" d=\"M173 62 V91 H250 V129 H229\"></path>\n      <path class=\"control\" d=\"M173 62 V91 H84 V217 H117\"></path>\n      <g class=\"legendSvg\">\n        <path class=\"data\" d=\"M330 190 H380\"></path>\n        <text x=\"394\" y=\"195\">：データの流れ</text>\n        <path class=\"control\" d=\"M330 222 H380\"></path>\n        <text x=\"394\" y=\"227\">：制御の流れ</text>\n      </g>\n    </svg>\n  </div>\n  <table class=\"dataTable compactTable\">\n    <tr><th></th><th>a</th><th>b</th><th>c</th></tr>\n    <tr><td>ア</td><td>演算装置</td><td>記憶装置</td><td>制御装置</td></tr>\n    <tr><td>イ</td><td>記憶装置</td><td>制御装置</td><td>演算装置</td></tr>\n    <tr><td>ウ</td><td>制御装置</td><td>演算装置</td><td>記憶装置</td></tr>\n    <tr><td>エ</td><td>制御装置</td><td>記憶装置</td><td>演算装置</td></tr>\n  </table>"
      },
      {
        "no": "問13",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "オペランドの個数は，その命令で指定する主記憶の番地の個数と等しい。"
          },
          {
            "key": "イ",
            "text": "一つのコンピュータでは，命令語長はすべて等しい。"
          },
          {
            "key": "ウ",
            "text": "命令語長が長いコンピュータほど，命令の種類も多くなる。"
          },
          {
            "key": "エ",
            "text": "命令の種類によっては，オペランドがないものもある。"
          }
        ],
        "text": "命令語に関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問14",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "実効アドレス計算"
          },
          {
            "key": "イ",
            "text": "入出力装置起動"
          },
          {
            "key": "ウ",
            "text": "分岐アドレス計算"
          },
          {
            "key": "エ",
            "text": "割込み発生"
          }
        ],
        "text": "主記憶へのアクセスを伴う演算命令を実行するとき，命令解読とオペランド読出しの間に行われる動作はどれか。"
      },
      {
        "no": "問15",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "アキュムレータ"
          },
          {
            "key": "イ",
            "text": "加算器"
          },
          {
            "key": "ウ",
            "text": "補数器"
          },
          {
            "key": "エ",
            "text": "命令デコーダ"
          }
        ],
        "text": "プロセッサは演算機構及び制御機構からなる。制御機構に分類されるものはどれか。"
      },
      {
        "no": "問16",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "プログラムをハードウェアの配線を組み替える方式"
          },
          {
            "key": "イ",
            "text": "プログラムを記憶装置に格納して、それを 1 行ずつ実行する方式。"
          },
          {
            "key": "ウ",
            "text": "脳の神経回路をモデルとした並列処理技術"
          },
          {
            "key": "エ",
            "text": "脳の神経回路をモデルとした並列処理技術"
          }
        ],
        "text": "ノイマン型コンピュータの説明として正しいものはどれえか？"
      },
      {
        "no": "問17",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "ALU"
          },
          {
            "key": "イ",
            "text": "アキュムレータ"
          },
          {
            "key": "ウ",
            "text": "命令デコーダ"
          },
          {
            "key": "エ",
            "text": "メモリアドレスレジスタ"
          }
        ],
        "text": "プロセッサの制御機構に分類されるものはどれか。"
      },
      {
        "no": "問18",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "20"
          },
          {
            "key": "イ",
            "text": "21"
          },
          {
            "key": "ウ",
            "text": "24"
          },
          {
            "key": "エ",
            "text": "25"
          }
        ],
        "text": "すべての命令が 5 サイクルで完了するように設計されたパイプライン制御のコンピュータがある。20 命令を実行するには何サイクル必要となるか。ここで，すべての命令は途中で停止することなく実行できるものとする。"
      },
      {
        "no": "問19",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "サブルーチンの数をできるだけ多くする。"
          },
          {
            "key": "イ",
            "text": "条件によって実行する文が変わる CASE 文を多くする。"
          },
          {
            "key": "ウ",
            "text": "分岐命令を少なくする。"
          },
          {
            "key": "エ",
            "text": "メモリアクセス命令を少なくする。"
          }
        ],
        "text": "CPU のパイプライン処理を有効に機能させるプログラミング方法はどれか。"
      },
      {
        "no": "問20",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "複数の命令を同時に実行するために，コンパイラが目的プログラムを生成する段階で，それぞれの命令がどの演算器を使うかをあらかじめ割り振る。"
          },
          {
            "key": "イ",
            "text": "命令が実行される段階で，どの演算器を使うかを動的に決めながら，複数の命令を同時に実行する。"
          },
          {
            "key": "ウ",
            "text": "命令の処理をプロセッサ内で複数のステージに細分化し，複数の命令を並列に実行する。"
          },
          {
            "key": "エ",
            "text": "命令を更に細かなマイクロ命令の組合せで実行する。"
          }
        ],
        "text": "パイプライン制御の特徴はどれか。"
      },
      {
        "no": "問21",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "a：GPU，b：暗号化"
          },
          {
            "key": "イ",
            "text": "a：GPU，b：画像"
          },
          {
            "key": "ウ",
            "text": "a：VGA，b：暗号化"
          },
          {
            "key": "エ",
            "text": "a：VGA，b：画像"
          }
        ],
        "text": "プロセッサに関する次の記述中の a，b に入れる字句の適切な組合せはどれか。 【 a 】は【 b 】処理用に開発されたプロセッサである。CPU に内蔵されている場合も多いが，より高度な【 b 】処理を行う場合には，高性能な【 a 】を搭載した拡張ボードを用いることもある。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th></th><th>a</th><th>b</th></tr>\n    <tr><td>ア</td><td>GPU</td><td>暗号化</td></tr>\n    <tr><td>イ</td><td>GPU</td><td>画像</td></tr>\n    <tr><td>ウ</td><td>VGA</td><td>暗号化</td></tr>\n    <tr><td>エ</td><td>VGA</td><td>画像</td></tr>\n  </table>"
      },
      {
        "no": "問22",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "命令長：固定，ハードウェアの制御：主にマイクロコード制御，演算の対象：メモリ，レジスタ"
          },
          {
            "key": "イ",
            "text": "命令長：固定，ハードウェアの制御：ワイヤードロジック型制御，演算の対象：レジスタ"
          },
          {
            "key": "ウ",
            "text": "命令長：可変，ハードウェアの制御：主にマイクロコード制御，演算の対象：レジスタ"
          },
          {
            "key": "エ",
            "text": "命令長：可変，ハードウェアの制御：ワイヤードロジック型制御，演算の対象：メモリ，レジスタ"
          }
        ],
        "text": "CISC と比較したときの RISC の特徴として，適切なものはどれか。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th></th><th>命令長</th><th>ハードウェアの制御</th><th>演算の対象</th></tr>\n    <tr><td>ア</td><td>固定</td><td>主にマイクロコード制御</td><td>メモリ，レジスタ</td></tr>\n    <tr><td>イ</td><td>固定</td><td>ワイヤードロジック型制御</td><td>レジスタ</td></tr>\n    <tr><td>ウ</td><td>可変</td><td>主にマイクロコード制御</td><td>レジスタ</td></tr>\n    <tr><td>エ</td><td>可変</td><td>ワイヤードロジック型制御</td><td>メモリ，レジスタ</td></tr>\n  </table>"
      },
      {
        "no": "問23",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "図ア"
          },
          {
            "key": "イ",
            "text": "図イ"
          },
          {
            "key": "ウ",
            "text": "図ウ"
          },
          {
            "key": "エ",
            "text": "図エ"
          }
        ],
        "text": "次の図のうち，パイプライン制御の説明として適切なものはどれか。ここで，図中の各記号の意味は次のとおりである。 F：命令呼出し，D：解読，A：アドレス計算，R：オペランド呼出し，E：実行",
        "figure": "<p class=\"figureTitle\">F：命令呼出し，D：解読，A：アドレス計算，R：オペランド呼出し，E：実行</p>\n  <div class=\"pipelineChoices\">\n    <div><b>ア</b><div class=\"pipeRows\"><span>命令1</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令2</span><i style=\"--c:7\">F</i><i style=\"--c:8\">D</i><i style=\"--c:9\">A</i><i style=\"--c:10\">R</i><i style=\"--c:11\">E</i><span>命令3</span><i style=\"--c:12\">F</i><i style=\"--c:13\">D</i><i style=\"--c:14\">A</i><i style=\"--c:15\">R</i><i style=\"--c:16\">E</i></div></div>\n    <div><b>イ</b><div class=\"pipeRows\"><span>命令1</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令2</span><i style=\"--c:5\">F</i><i style=\"--c:6\">D</i><i style=\"--c:7\">A</i><i style=\"--c:8\">R</i><i style=\"--c:9\">E</i><span>命令3</span><i style=\"--c:8\">F</i><i style=\"--c:9\">D</i><i style=\"--c:10\">A</i><i style=\"--c:11\">R</i><i style=\"--c:12\">E</i></div></div>\n    <div><b>ウ</b><div class=\"pipeRows\"><span>命令1</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令2</span><i style=\"--c:3\">F</i><i style=\"--c:4\">D</i><i style=\"--c:5\">A</i><i style=\"--c:6\">R</i><i style=\"--c:7\">E</i><span>命令3</span><i style=\"--c:4\">F</i><i style=\"--c:5\">D</i><i style=\"--c:6\">A</i><i style=\"--c:7\">R</i><i style=\"--c:8\">E</i></div></div>\n    <div><b>エ</b><div class=\"pipeRows\"><span>命令1</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令2</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令3</span><i style=\"--c:3\">F</i><i style=\"--c:4\">D</i><i style=\"--c:5\">A</i><i style=\"--c:6\">R</i><i style=\"--c:7\">E</i></div></div>\n  </div>"
      },
      {
        "no": "問24",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "AR"
          },
          {
            "key": "イ",
            "text": "DVI"
          },
          {
            "key": "ウ",
            "text": "GPU"
          },
          {
            "key": "エ",
            "text": "MPEG"
          }
        ],
        "text": "PC やスマートフォンなどの表示画面の画像処理用のチップとして用いられているほか， AI における膨大な計算処理にも利用されているものはどれか。"
      },
      {
        "no": "問25",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "32 ビットCPU と64 ビット CPU では，64 ビット CPU の方が一度に処理するデータ長を大きくできる。"
          },
          {
            "key": "イ",
            "text": "CPU 内のキャッシュメモリの容量は，少ないほど CPU の処理速度が向上する。"
          },
          {
            "key": "ウ",
            "text": "同じ構造の CPU において，クロック周波数を下げると処理速度が向上する。"
          },
          {
            "key": "エ",
            "text": "デュアルコア CPU とクアッドコア CPU では，デュアルコア CPU の方が同時に実行する処理の数を多くできる。"
          }
        ],
        "text": "CPU の性能に関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問26",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "34"
          },
          {
            "key": "イ",
            "text": "100"
          },
          {
            "key": "ウ",
            "text": "125"
          },
          {
            "key": "エ",
            "text": "133"
          }
        ],
        "text": "クロック周波数が 1 GHz の CPU がある。この CPU の命令種別が，表に示す二つから成っているとき，処理能力は約何 MIPS か。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th>命令種別</th><th>実行時間（クロック）</th><th>実行頻度（%）</th></tr>\n    <tr><td>命令1</td><td>10</td><td>60</td></tr>\n    <tr><td>命令2</td><td>5</td><td>40</td></tr>\n  </table>"
      },
      {
        "no": "問27",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "単一の命令を基に，複数のデータに対して複数のプロセッサが同期をとりながら並列にそれぞれのデータを処理する方式"
          },
          {
            "key": "イ",
            "text": "一つのプロセッサにおいて，単一の命令に対する実行時間をできるだけ短くする方式"
          },
          {
            "key": "ウ",
            "text": "一つのプロセッサにおいて，複数の命令を少しずつ段階をずらしながら同時実行する方式"
          },
          {
            "key": "エ",
            "text": "複数のプロセッサが，それぞれ独自の命令を基に複数のデータを処理する方式"
          }
        ],
        "text": "プロセッサにおけるパイプライン処理方式を説明したものはどれか。"
      },
      {
        "no": "問28",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "USB 接続された周辺機器と CPU の間のデータ転送速度は，クロックの周波数によって決まる。"
          },
          {
            "key": "イ",
            "text": "クロックの間隔が短いほど命令実行に時間が掛かる。"
          },
          {
            "key": "ウ",
            "text": "クロックは，次に実行すべき命令の格納位置を記録する。"
          },
          {
            "key": "エ",
            "text": "クロックは，命令実行のタイミングを調整する。"
          }
        ],
        "text": "CPU のクロックに関する説明のうち，適切なものはどれか。"
      },
      {
        "no": "問29",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "処理すべきベクトルの長さがベクトルレジスタより長い場合，ベクトルレジスタ長の組に分割して処理を繰り返す方式である。"
          },
          {
            "key": "イ",
            "text": "パイプラインを更に細分化することによって高速化を図る方式である。"
          },
          {
            "key": "ウ",
            "text": "複数のパイプラインを用いて，同時に複数の命令を実行可能にすることによって高速化を図る方式である。"
          },
          {
            "key": "エ",
            "text": "命令語を長く取り，一つの命令で複数の機能ユニットを同時に制御することによって高速化を図る方式である。"
          }
        ],
        "text": "スーパスカラの説明はどれか。"
      },
      {
        "no": "問30",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "5"
          },
          {
            "key": "イ",
            "text": "10"
          },
          {
            "key": "ウ",
            "text": "20"
          },
          {
            "key": "エ",
            "text": "50"
          }
        ],
        "text": "平均命令実行時間が20 ナノ秒のコンピュータがある。このコンピュータの性能は何MIPS か。"
      },
      {
        "no": "問31",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "20 ナノ秒"
          },
          {
            "key": "イ",
            "text": "50 ナノ秒"
          },
          {
            "key": "ウ",
            "text": "2 マイクロ秒"
          },
          {
            "key": "エ",
            "text": "5 マイクロ秒"
          }
        ],
        "text": "50 MIPS のプロセッサの平均命令実行時間は幾らか。"
      },
      {
        "no": "問32",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "インデックスレジスタ"
          },
          {
            "key": "イ",
            "text": "汎用レジスタ"
          },
          {
            "key": "ウ",
            "text": "プログラムカウンタ"
          },
          {
            "key": "エ",
            "text": "命令レジスタ"
          }
        ],
        "text": "処理装置を構成する要素のうち，分岐命令の実行によって更新されるものはどれか。"
      },
      {
        "no": "問33",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "間接アドレス指定"
          },
          {
            "key": "イ",
            "text": "指標アドレス指定"
          },
          {
            "key": "ウ",
            "text": "相対アドレス指定"
          },
          {
            "key": "エ",
            "text": "直接アドレス指定"
          }
        ],
        "text": "主記憶のデータを図のように参照するアドレス指定方式はどれか。",
        "figure": "<p class=\"figureTitle\">アドレス部 20 が主記憶 20 番地を参照し，その内容 25 をさらにアドレスとして参照する。</p>\n  <div class=\"addressFigure\">\n    <div class=\"instructionBox\"><span>命令部</span><span>アドレス部<br><b>20</b></span></div>\n    <div class=\"arrowLine\">→</div>\n    <table class=\"memoryTable\"><tr><th>アドレス</th><th>主記憶</th></tr><tr><td>20</td><td>25</td></tr><tr><td>25</td><td>データ</td></tr></table>\n  </div>"
      },
      {
        "no": "問34",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "1201"
          },
          {
            "key": "イ",
            "text": "1300"
          },
          {
            "key": "ウ",
            "text": "2200"
          },
          {
            "key": "エ",
            "text": "2300"
          }
        ],
        "text": "“LOAD GR, B, AD”は，AD が示す番地にベースレジスタ B の内容を加えた値を有効アドレスとして，その有効アドレスが示す主記憶に格納されているデータを汎用レジスタ GR にロ ードする命令である。図の状態で，次の命令を実行したとき，汎用レジスタ GR にロードされるデータはどれか。 LOAD GR, 1, 200",
        "figure": "<p class=\"figureTitle\">ベースレジスタ1 = 100，命令：LOAD GR, 1, 200</p>\n  <div class=\"addressFigure\">\n    <table class=\"dataTable compactTable\"><tr><th>番地</th><th>主記憶</th></tr><tr><td>100</td><td>1100</td></tr><tr><td>101</td><td>1101</td></tr><tr><td>200</td><td>1200</td></tr><tr><td>201</td><td>1201</td></tr><tr><td>300</td><td>1300</td></tr><tr><td>301</td><td>1301</td></tr><tr><td>1200</td><td>2200</td></tr><tr><td>1201</td><td>2201</td></tr><tr><td>1300</td><td>2300</td></tr><tr><td>1301</td><td>2301</td></tr></table>\n  </div>"
      },
      {
        "no": "問35",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "指標付きアドレス指定方式"
          },
          {
            "key": "イ",
            "text": "相対アドレス指定方式"
          },
          {
            "key": "ウ",
            "text": "直接アドレス指定方式"
          },
          {
            "key": "エ",
            "text": "間接アドレス指定方式"
          }
        ],
        "text": "図に示すアドレス指定方式はどれか。",
        "figure": "<p class=\"figureTitle\">レジスタ番号 2 の内容 50 とアドレス定数 100 を加え，150 番地を参照する。</p>\n  <div class=\"addressFigure\">\n    <div class=\"instructionBox three\"><span>命令部</span><span>レジスタ番号<br><b>2</b></span><span>アドレス定数<br><b>100</b></span></div>\n    <table class=\"dataTable compactTable\"><tr><th>レジスタ番号</th><th>値</th></tr><tr><td>0</td><td></td></tr><tr><td>1</td><td></td></tr><tr><td>2</td><td>50</td></tr><tr><td>3</td><td></td></tr></table>\n    <table class=\"dataTable compactTable\"><tr><th>主記憶アドレス</th><th>内容</th></tr><tr><td>150番地</td><td>処理対象データ</td></tr></table>\n  </div>"
      },
      {
        "no": "問36",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "間接アドレス"
          },
          {
            "key": "イ",
            "text": "指標付きアドレス"
          },
          {
            "key": "ウ",
            "text": "即値オペランド"
          },
          {
            "key": "エ",
            "text": "直接アドレス"
          }
        ],
        "text": "アドレス指定方式のうち，命令読出し後のメモリ参照を行わずにデータを取り出すものはどれか。"
      },
      {
        "no": "問37",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "110"
          },
          {
            "key": "イ",
            "text": "1010"
          },
          {
            "key": "ウ",
            "text": "1100"
          },
          {
            "key": "エ",
            "text": "1110"
          }
        ],
        "text": "どれか。 インデックス修飾によってオペランドを指定する場合，表に示す値のときの実効アドレスは",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><td class=\"left\">インデックスレジスタの値</td><td>10</td></tr>\n    <tr><td class=\"left\">命令語のアドレス部の値</td><td>100</td></tr>\n    <tr><td class=\"left\">命令が格納されているアドレス</td><td>1000</td></tr>\n  </table>"
      },
      {
        "no": "問38",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "コンデンサに電荷を蓄えた状態か否かによって 1 ビットを表現する。主記憶としてよく用いられる。"
          },
          {
            "key": "イ",
            "text": "製造時にデータが書き込まれる。マイクロプログラム格納用メモリとして用いられる。"
          },
          {
            "key": "ウ",
            "text": "専用の装置でデータを書き込むことができ，紫外線照射で消去ができる。"
          },
          {
            "key": "エ",
            "text": "フリップフロップで構成され，高速であるが製造コストが高い。キャッシュメモリなどに用いられる。"
          }
        ],
        "text": "DRAM の説明として，適切なものはどれか。"
      },
      {
        "no": "問39",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "一定時間ごとに内容を外部記憶装置に書き込む。"
          },
          {
            "key": "イ",
            "text": "システムの電源投入時に，全領域を 0 で初期化する。"
          },
          {
            "key": "ウ",
            "text": "データを保持するために，一定時間ごとにアクセスする。"
          },
          {
            "key": "エ",
            "text": "内容を更新するときに，データを一旦消去する。"
          }
        ],
        "text": "DRAM のリフレッシュ動作の説明として，適切なものはどれか。"
      },
      {
        "no": "問40",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "DRAM"
          },
          {
            "key": "イ",
            "text": "SRAM"
          },
          {
            "key": "ウ",
            "text": "フラッシュメモリ"
          },
          {
            "key": "エ",
            "text": "マスク ROM"
          }
        ],
        "text": "ディジタルカメラの画像データや携帯音楽プレーヤの音楽データの記録媒体として利用されているものはどれか。"
      },
      {
        "no": "問41",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "書込み及び消去を一括又はブロック単位で行う。"
          },
          {
            "key": "イ",
            "text": "データを保持するためのリフレッシュ操作又はアクセス操作が不要である。"
          },
          {
            "key": "ウ",
            "text": "電源が遮断された状態でも，記憶した情報を保持することができる。"
          },
          {
            "key": "エ",
            "text": "メモリセル構造が単純なので高集積化することができ，ビット単価を安くできる。"
          }
        ],
        "text": "DRAM の特徴はどれか。"
      },
      {
        "no": "問42",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "紫外線照射で内容を消去することによって，メモリ部品を再利用することができる。"
          },
          {
            "key": "イ",
            "text": "出荷後のプログラムの不正な書換えを防ぐことができる。"
          },
          {
            "key": "ウ",
            "text": "製品の量産後にシリアル番号などの個体識別データを書き込むことができる。"
          },
          {
            "key": "エ",
            "text": "動作中に主記憶が不足した場合，補助記憶として使用することができる。"
          }
        ],
        "text": "組込みシステムのプログラムを格納するメモリとして，マスク ROM を使用するメリットはどれか。"
      },
      {
        "no": "問43",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "高速に書換えができ，CPU のキャッシュメモリなどに用いられる。 SRAM の説明"
          },
          {
            "key": "イ",
            "text": "紫外線で全内容の消去ができる。"
          },
          {
            "key": "ウ",
            "text": "周期的にデータの再書込みが必要である。"
          },
          {
            "key": "エ",
            "text": "ブロック単位で電気的に消去できる。"
          }
        ],
        "text": "フラッシュメモリに関する記述として，適切なものはどれか。"
      },
      {
        "no": "問44",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "AND ゲート"
          },
          {
            "key": "イ",
            "text": "加算器"
          },
          {
            "key": "ウ",
            "text": "キャパシタ"
          },
          {
            "key": "エ",
            "text": "フリップフロップ"
          }
        ],
        "text": "二つの安定状態をもつ回路で，SRAM の記憶セルに使用される順序回路の基本構成要素はどれか。"
      },
      {
        "no": "問45",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "DRAM"
          },
          {
            "key": "イ",
            "text": "RDRAM"
          },
          {
            "key": "ウ",
            "text": "SDRAM"
          },
          {
            "key": "エ",
            "text": "SRAM"
          }
        ],
        "text": "フリップフロップ回路を利用した高速なメモリはどれか。"
      },
      {
        "no": "問46",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "キャッシュメモリ：10ナノ秒，ヒット率：60%，主記憶：70ナノ秒"
          },
          {
            "key": "イ",
            "text": "キャッシュメモリ：10ナノ秒，ヒット率：70%，主記憶：70ナノ秒"
          },
          {
            "key": "ウ",
            "text": "キャッシュメモリ：20ナノ秒，ヒット率：70%，主記憶：50ナノ秒"
          },
          {
            "key": "エ",
            "text": "キャッシュメモリ：20ナノ秒，ヒット率：80%，主記憶：50ナノ秒"
          }
        ],
        "text": "キャッシュメモリと主記憶に関するアクセス時間とヒット率の組合せのうち，主記憶の実効アクセス時間が最も短くなるのはどれか。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th></th><th colspan=\"2\">キャッシュメモリ</th><th>主記憶</th></tr>\n    <tr><th></th><th>アクセス時間（ナノ秒）</th><th>ヒット率（%）</th><th>アクセス時間（ナノ秒）</th></tr>\n    <tr><td>ア</td><td>10</td><td>60</td><td>70</td></tr>\n    <tr><td>イ</td><td>10</td><td>70</td><td>70</td></tr>\n    <tr><td>ウ</td><td>20</td><td>70</td><td>50</td></tr>\n    <tr><td>エ</td><td>20</td><td>80</td><td>50</td></tr>\n  </table>"
      },
      {
        "no": "問47",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "0.75"
          },
          {
            "key": "イ",
            "text": "0.90"
          },
          {
            "key": "ウ",
            "text": "0.95"
          },
          {
            "key": "エ",
            "text": "0.96"
          }
        ],
        "text": "図に示す構成で，表に示すようにキャッシュメモリと主記憶のアクセス時間だけが異なり， ほかの条件は同じ 2 種類の CPU X と Y がある。 あるプログラムを CPU X と Y でそれぞれ実行したところ，両者の処理時間が等しかった。このとき，キャッシュメモリのヒット率は幾らか。ここで，CPU 処理以外の影響はないものとする。",
        "figure": "<div class=\"cacheLayout\"><div class=\"cacheBox\"><div>CPU</div><div>キャッシュメモリ<br>256Kバイト</div></div><div class=\"cacheBox\">主記憶<br>256Mバイト</div></div>\n  <table class=\"dataTable compactTable\">\n    <tr><th>アクセス時間<br>単位 ナノ秒</th><th>CPU X</th><th>CPU Y</th></tr>\n    <tr><td>キャッシュメモリ</td><td>40</td><td>20</td></tr>\n    <tr><td>主記憶</td><td>400</td><td>580</td></tr>\n  </table>"
      },
      {
        "no": "問48",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "書込み命令を実行したときに，キャッシュメモリと主記憶の両方を書き換える方式と，キャッシュメモリだけを書き換えておき，主記憶の書換えはキャッシュメモリから当該データが追い出されるときに行う方式とがある。"
          },
          {
            "key": "イ",
            "text": "キャッシュメモリにヒットしない場合に割込みが生じ，プログラムによって主記憶からキャッシュメモリにデータが転送される。"
          },
          {
            "key": "ウ",
            "text": "キャッシュメモリは，実記憶と仮想記憶とのメモリ容量の差を埋めるために採用される。"
          },
          {
            "key": "エ",
            "text": "半導体メモリのアクセス速度の向上が著しいので，キャッシュメモリの必要性は減っている。"
          }
        ],
        "text": "キャッシュメモリに関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問49",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "キャッシュメモリから所要のデータをブロック転送し，磁気ディスクに書き込む。"
          },
          {
            "key": "イ",
            "text": "磁気ディスクから所要のデータをブロック転送し，キャッシュメモリに読み込む。"
          },
          {
            "key": "ウ",
            "text": "主記憶から所要のデータをブロック転送し，キャッシュメモリに読み込む。"
          },
          {
            "key": "エ",
            "text": "ディスクキャッシュから所要のデータをブロック転送し，主記憶に読み込む。"
          }
        ],
        "text": "プロセッサにデータを読み込む時にキャッシュメモリにヒットしなかった場合， キャッシュメモリ制御装置が行う動作はどれか。"
      },
      {
        "no": "問50",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "CPU から主記憶へのアクセスを高速化するために，キャッシュメモリと主記憶との両方に同時にデータを書き込む。"
          },
          {
            "key": "イ",
            "text": "CPU から主記憶へのアクセスを高速化するために，主記憶内部を複数のバンクに分割し， 各バンクを並列にアクセスする。"
          },
          {
            "key": "ウ",
            "text": "CPU と主記憶のアクセス速度の違いによるボトルネックを解消するために，高速かつ小容量のメモリを配置する。"
          },
          {
            "key": "エ",
            "text": "パイプライン処理を乱す要因をなくすために，キャッシュメモリを命令用とデータ用の二つに分離する。"
          }
        ],
        "text": "メモリインタリーブの説明として，適切なものはどれか。"
      },
      {
        "no": "問51",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "0.2"
          },
          {
            "key": "イ",
            "text": "0.3"
          },
          {
            "key": "ウ",
            "text": "0.5"
          },
          {
            "key": "エ",
            "text": "0.8"
          }
        ],
        "text": "システム A，B のキャッシュメモリと主記憶のアクセス時間は，表のとおりである。あるプログラムをシステム A で実行したときのキャッシュメモリのヒット率と実効アクセス時間は，システム B で実行したときと同じになった。このときのキャッシュメモリのヒット率は幾らか。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th>単位 ナノ秒</th><th>システムA</th><th>システムB</th></tr>\n    <tr><td>キャッシュメモリ</td><td>15</td><td>10</td></tr>\n    <tr><td>主記憶</td><td>50</td><td>70</td></tr>\n  </table>"
      },
      {
        "no": "問52",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "0.1"
          },
          {
            "key": "イ",
            "text": "0.17"
          },
          {
            "key": "ウ",
            "text": "0.83"
          },
          {
            "key": "エ",
            "text": "0.9"
          }
        ],
        "text": "主記憶のアクセス時間 60 ナノ秒，キャッシュメモリのアクセス時間 10 ナノ秒のシステムがある。キャッシュメモリを介して主記憶にアクセスする場合の実効アクセス時間が 15 ナノ秒であるとき，キャッシュメモリのヒット率は幾らか。"
      },
      {
        "no": "問53",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "CPU と磁気ディスク装置との間に半導体メモリによるデータバッファを設けて，磁気ディスクアクセスの高速化を図る。"
          },
          {
            "key": "イ",
            "text": "主記憶のデータの一部をキャッシュメモリにコピーすることによって， CPU と主記憶とのアクセス速度のギャップを埋め，メモリアクセスの高速化を図る。"
          },
          {
            "key": "ウ",
            "text": "主記憶へのアクセスを高速化するため，アクセス要求，データの読み書き及び後処理が終わってから，次のメモリアクセスの処理に移る。"
          },
          {
            "key": "エ",
            "text": "主記憶を複数の独立したグループに分けて，各グループに交互にアクセスすることによって，主記憶へのアクセスの高速化を図る。"
          }
        ],
        "text": "メモリインタリーブの説明はどれか。"
      }
    ]
  }
];
